Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

Step 2. Create 3 differents Series, each of length 100, as follows:
        1.The first a random number from 1 to 4
        2.The second a random number from 1 to 3
        3.The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(s1, s2, s3)

0     3
1     2
2     1
3     2
4     2
     ..
95    3
96    4
97    3
98    4
99    4
Length: 100, dtype: int32 0     2
1     2
2     3
3     1
4     2
     ..
95    1
96    3
97    1
98    1
99    3
Length: 100, dtype: int32 0     12431
1     10186
2     19360
3     29068
4     14901
      ...
95    18818
96    28717
97    25993
98    12470
99    15438
Length: 100, dtype: int32

Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  3  2  12431
1  2  2  10186
2  1  3  19360
3  2  1  29068
4  2  2  14901

Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [ ]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemkt.head()

Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [4]:
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       3
1       2
2       1
3       2
4       2
..    ...
95  18818
96  28717
97  25993
98  12470
99  15438

[300 rows x 1 columns]

Step 6. Oops, it seems it is going only until index 99. Is it true?

In [5]:
# no the index are kept but the length of the DataFrame is 300
len(bigcolumn)

300

Step 7. Reindex the DataFrame so it goes from 0 to 299

In [6]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        3
1        2
2        1
3        2
4        2
..     ...
295  18818
296  28717
297  25993
298  12470
299  15438

[300 rows x 1 columns]